





RADIUS Working Group                                            C Rigney
Internet Draft                                                Livingston
                                                                A Rubens
                                                                   Merit
                                                             W A Simpson
                                                              Daydreamer
                                                               S Willens
                                                              Livingston
expires in six months                                           May 1995


          Remote Authentication Dial In User Service (RADIUS)
                    draft-ietf-radius-radius-00.txt



Status of this Memo

   This document is a submission to the RADIUS Working Group of the
   Internet Engineering Task Force (IETF).  Comments should be submitted
   to the ietf-radius@livingston.com mailing list.

   Distribution of this memo is unlimited.

   This document is an Internet-Draft.  Internet-Drafts are working
   documents of the Internet Engineering Task Force (IETF), its areas,
   and its working groups.  Note that other groups may also distribute
   working documents as Internet-Drafts.

   Internet-Drafts are draft documents valid for a maximum of six months
   and may be updated, replaced, or obsoleted by other documents at any
   time.  It is inappropriate to use Internet-Drafts as reference
   material or to cite them other than as ``work in progress.''

   To learn the current status of any Internet-Draft, please check the
   ``1id-abstracts.txt'' listing contained in the Internet-Drafts Shadow
   Directories on ds.internic.net (US East Coast), nic.nordu.net
   (Europe), ftp.isi.edu (US West Coast), or munnari.oz.au (Pacific
   Rim).


Abstract

   This document describes a protocol for carrying authentication,
   authorization, and configuration information between a Network Access
   Server which desires to authenticate its links and a shared
   Authentication Server.




Rigney, et alia          expires in six months                  [Page i]
DRAFT                    RADIUS Authentication                  May 1995


                           Table of Contents


     1.     Introduction ..........................................    1
        1.1       Specification of Requirements ...................    2
        1.2       Terminology .....................................    2

     2.     Operation .............................................    3
        2.1       Challenge/Response ..............................    4
        2.2       Interoperation with PAP and CHAP ................    5
        2.3       Why UDP? ........................................    5

     3.     Packet Format .........................................    7

     4.     Packet Types ..........................................   10
        4.1       Access-Request ..................................   10
        4.2       Access-Accept ...................................   11
        4.3       Access-Reject ...................................   12
        4.4       Access-Challenge ................................   13

     5.     Attributes ............................................   16
        5.1       User-Name .......................................   18
        5.2       User-Password ...................................   19
        5.3       CHAP-Password ...................................   20
        5.4       NAS-IP-Address ..................................   20
        5.5       NAS-Port ........................................   21
        5.6       Service-Type ....................................   22
        5.7       Framed-Protocol .................................   23
        5.8       Framed-IP-Address ...............................   24
        5.9       Framed-IP-Netmask ...............................   24
        5.10      Framed-Routing ..................................   25
        5.11      Filter-Id .......................................   26
        5.12      Framed-MTU ......................................   27
        5.13      Framed-Compression ..............................   27
        5.14      Login-IP-Host ...................................   28
        5.15      Login-Service ...................................   29
        5.16      Login-Port ......................................   30
        5.17      (unassigned) ....................................   30
        5.18      Reply-Message ...................................   31
        5.19      Login-Callback-Number ...........................   32
        5.20      Framed-Callback-Id ..............................   32
        5.21      (unassigned) ....................................   33
        5.22      Framed-Route ....................................   33
        5.23      Framed-IPX-Network ..............................   34
        5.24      State ...........................................   35
        5.25      Class ...........................................   36
        5.26      Vendor-Specific .................................   37
        5.27      Session-Timeout .................................   38



Rigney, et alia          expires in six months                 [Page ii]
DRAFT                    RADIUS Authentication                  May 1995


        5.28      Idle-Timeout ....................................   38
        5.29      Termination-Action ..............................   39
        5.30      Client-Port-DNIS ................................   40
        5.31      Caller-Id .......................................   41
        5.32      NAS-Identifier ..................................   42
        5.33      Proxy-State .....................................   43
        5.34      Login-LAT-Service ...............................   44
        5.35      Login-LAT-Node ..................................   45
        5.36      Login-LAT-Group .................................   46
        5.37      Framed-AppleTalk-Link ...........................   47
        5.38      Framed-AppleTalk-Network ........................   47
        5.39      Framed-AppleTalk-Zone ...........................   48
        5.40      Table of Attributes .............................   50

     SECURITY CONSIDERATIONS ......................................   52

     REFERENCES ...................................................   53

        ACKNOWLEDGEMENTS ..........................................   53

     CHAIR'S ADDRESS ..............................................   54

     AUTHOR'S ADDRESS .............................................   54




























Rigney, et alia          expires in six months                  [Page iii]
DRAFT                    RADIUS Authentication                  May 1995


1.  Introduction

   Managing dispersed serial line and modem pools for large numbers of
   users can create the need for significant administrative support.
   Since modem pools are by definition a link to the outside world, they
   require careful attention to security, authorization and accounting.
   This can be best achieved by managing a single "database" of users,
   which allows for authentication (verifying user name and password) as
   well as configuration information detailing the type of service to
   deliver to the user (that is, SLIP, PPP, telnet, rlogin).

   Key features of RADIUS are:

   Client/Server Model

      A Network Access Server (NAS) operates as a client of RADIUS.  The
      client is responsible for passing user information to designated
      RADIUS servers, and then acting on the response which is returned.

      RADIUS servers are responsible for receiving user connection
      requests, authenticating the user, and then returning all
      configuration information necessary for the client to deliver
      service to the user.

      The RADIUS servers can act as proxy clients to other kinds of
      authentication servers.

   Network Security

      Transactions between the client and RADIUS server are
      authenticated through the use of a shared secret, which is never
      sent over the network.  In addition, any user passwords are sent
      encrypted between the client and RADIUS server, to eliminate the
      possibility that someone snooping on an unsecure network could
      determine a user's password.

   Flexible Authentication Mechanisms

      The RADIUS server supports a variety of methods to authenticate a
      user.  When it is provided with the user name and original
      password given by the user, it can support PPP PAP or CHAP, UNIX
      login, and other authentication mechanisms.

   Extensible Protocol

      All transactions are comprised of variable length 
      Attribute-Length-Value 3-tuples.  New attribute values can be
      added without disturbing existing implementations of the protocol.



Rigney, et alia          expires in six months                  [Page 1]
DRAFT                    RADIUS Authentication                  May 1995




   Source Code Availability

      Livingston Enterprises is making the C source code for an example
      RADIUS server available without use restrictions.  Other vendors
      have also implemented RADIUS.


1.1.  Specification of Requirements

   In this document, several words are used to signify the requirements
   of the specification.  These words are often capitalized.

   MUST      This word, or the adjective "required", means that the
             definition is an absolute requirement of the specification.

   MUST NOT  This phrase means that the definition is an absolute
             prohibition of the specification.

   SHOULD    This word, or the adjective "recommended", means that there
             may exist valid reasons in particular circumstances to
             ignore this item, but the full implications must be
             understood and carefully weighed before choosing a
             different course.

   MAY       This word, or the adjective "optional", means that this
             item is one of an allowed set of alternatives.  An
             implementation which does not include this option MUST be
             prepared to interoperate with another implementation which
             does include the option.


1.2.  Terminology

   This document frequently uses the following terms:

   silently discard
             This means the implementation discards the packet without
             further processing.  The implementation SHOULD provide the
             capability of logging the error, including the contents of
             the silently discarded packet, and SHOULD record the event
             in a statistics counter.








Rigney, et alia          expires in six months                  [Page 2]
DRAFT                    RADIUS Authentication                  May 1995


2.  Operation

   When a client is configured to use RADIUS, any user of the client
   presents authentication information to the client.  This might be
   with a customizable login prompt, where the user is expected to enter
   their username and password.  Alternatively, the user might use a
   link framing protocol such as the Point-to-Point Protocol (PPP),
   which has authentication packets which carry this information.

   Once the client has obtained such information, it first looks in its
   local database of users for the username.  If found, the user is
   locally authenticated.  If not found, the client will create an
   "Access-Request" containing such Attributes as the user's name, the
   user's password, the ID of the client and the Port ID which the user
   is accessing.  When a password is present, it is hidden using a
   method based on the RSA Message Digest Algorithm MD5 [3].

   The Access-Request is submitted to the RADIUS server via the network.
   If no response is returned within a configurable length of time, the
   request is re-sent a configurable number of times.  After several
   failed attempts, the client can also forward requests to an alternate
   server in the event that the primary server is down or unreachable.

   Once the RADIUS server receives the request, it validates the sending
   client.  The RADIUS server consults a local database of users to find
   the user whose name matches the request.  The user entry in the
   database contains a list of requirements which must be met to allow
   access for the user.  This always includes verification of the
   password, but can also specify the client(s) or Port(s) to which the
   user is allowed access.

   The RADIUS server MAY make requests of other servers in order to
   satisfy the request, in which case it acts as a client.

   If any condition is not met, the RADIUS server sends an
   "Access-Reject" response indicating that this user request is 
   invalid.  If desired, the server MAY also send a text message which
   MAY be displayed by the client to the user.  No other Attributes are
   permitted in an "Access-Reject".

   If all conditions are met and the RADIUS server wishes to issue a
   challenge to which the user must respond, the RADIUS server sends an
   "Access-Challenge" response.

   If the client receives an Access-Challenge and supports
   challenge/response it MAY display the text message, if any, to the
   user, and then prompt the user for a response.  It then re-submits
   its original Access-Request with a new request ID, with the



Rigney, et alia          expires in six months                  [Page 3]
DRAFT                    RADIUS Authentication                  May 1995


   User-Password Attribute replaced by the response (encrypted), and
   including the State Attribute from the "Access-Challenge", if any.
   Only 0 or 1 instances of the State Attributes should be present in a
   request.

   If all conditions are met, the list of configuration values for the
   user are placed into an "Access-Accept" response.  These values
   include the type of service (for example: SLIP, PPP, Login User) and
   all necessary values to deliver the desired service.  For SLIP and
   PPP, this may include values such as IP addresses, subnet masks, MTU,
   desired compression, and desired packet filters.  For character mode
   users, this may include values such as desired protocol, host, and
   access control filter.


2.1.  Challenge/Response

   In challenge/response authentication, individual users are given an
   unpredictable number and challenged to encrypt it and give back the
   result. Authorized users are equipped with special devices such as
   smart cards that facilitate calculation of the correct response with
   ease. Unauthorized users, lacking the appropriate device and lacking
   knowledge of the secret key necessary to emulate such a device, can
   only guess at the response.

   The Access-Challenge packet typically contains a Reply-Message
   including a challenge to be displayed to the user, such as a numeric
   value unlikely ever to be repeated. Typically this is obtained from
   an external server that knows what type of authenticator should be in
   the possession of the authorized user and can therefore choose a
   random or non-repeating pseudorandom number of an appropriate radix
   and length.

   The user then enters the challenge into his device and it calculates
   a response, which the user enters into the client which forwards it
   to the RADIUS server via a second Access-Request.  If the response
   matches the expected response the RADIUS server replies with an
   Access-Accept, otherwise an Access-Reject.

   Example: The NAS sends an Access-Request packet to the RADIUS Server
   with NAS-Identifier, NAS-Port, User-Name, User-Password (which may
   just be a fixed string like "challenge" or ignored).  The server
   sends back an Access-Challenge packet with State and a Reply-Message
   along the lines of "Challenge 12345678, enter your response at the
   prompt" which the NAS displays.  The NAS prompts for the response and
   sends a NEW Access-Request to the server (with a new ID) with 
   NAS-Identifier, NAS-Port, User-Name, User-Password (the response just
   entered by the user, encrypted), and the same State Attribute that



Rigney, et alia          expires in six months                  [Page 4]
DRAFT                    RADIUS Authentication                  May 1995


   came with the Access-Challenge.  The server then sends back either an
   Access-Accept or Access-Reject based on whether the response matches
   what it should be, or it can even send another Access-Challenge.


2.2.  Interoperation with PAP and CHAP

   For PAP, the NAS takes the PAP ID and password and sends them in an
   Access-Request packet as the User-Name and User-Password. The NAS MAY
   include the Attributes Service-Type = Framed-User and Framed-Protocol
   = PPP as a hint to the RADIUS server that PPP service is expected.

   For CHAP, the NAS generates a 16 octet random challenge and sends it
   to the user (the thing dialing in requesting authentication), which
   returns a CHAP response along with a CHAP ID and CHAP username.  The
   NAS then sends an Access-Request packet to the RADIUS server with the
   CHAP username as the User-Name and with the CHAP ID and CHAP response
   as the CHAP-Password (Attribute 3).  The random challenge is included
   in the Authenticator field of the Access-Request packet.  The NAS MAY
   include the Attributes Service-Type = Framed-User and Framed-Protocol
   = PPP as a hint to the RADIUS server that PPP service is expected.

   The RADIUS server looks up the CHAP password based on the User-Name,
   encrypts the challenge, and compares that to the CHAP-Password.  If
   they match, it sends back an Access-Accept, otherwise it sends back
   an Access-Reject.


2.3.  Why UDP?

   A frequently asked question is why RADIUS uses UDP instead of TCP as
   a transport protocol.  UDP was chosen for strictly technical reasons.

   There are a number of issues which must be understood.  RADIUS is a
   transaction based protocol which has several interesting
   characteristics:

   1.   If the request to a primary Authentication server fails, a
        secondary server must be queried.

        To meet this requirement, a copy of the request must be kept
        above the transport layer to allow for alternate transmission.
        This means that retransmission timers are still required.

   2.   The timing requirements of this particular protocol are
        significantly different than TCP provides.

        At one extreme, RADIUS does not require a "responsive" detection



Rigney, et alia          expires in six months                  [Page 5]
DRAFT                    RADIUS Authentication                  May 1995


        of lost data.  The user is willing to wait several seconds for
        the authentication to complete.  The generally aggressive TCP
        retransmission (based on average round trip time) is not
        required, nor is the acknowledgement overhead of TCP.

        At the other extreme, the user is not willing to wait several
        minutes for authentication.  Therefore the reliable delivery of
        TCP data two minutes later is not useful.  The faster use of an
        alternate server allows the user to gain access before giving
        up.

   3.   The stateless nature of this protocol simplifies the use of UDP.

        Clients and servers come and go.  Systems are rebooted, or are
        power cycled independently.  Generally this does not cause a
        problem and with creative timeouts and detection of lost TCP
        connections, code can be written to handle anomalous events.
        UDP however completely eliminates any of this special handling.
        Each client and server can open their UDP transport just once
        and leave it open through all types of failure events on the
        network.

   4.   UDP simplifies the server implementation.

        In the earliest implementations of RADIUS, the server was single
        threaded.  This means that a single request was received,
        processed, and returned.  This was found to be unmanageable in
        environments where the back-end security mechanism took real
        time (1 or more seconds).  The server request queue would fill
        and in environments where hundreds of people where being
        authenticated every minute, the request turn-around time
        increased to longer that users were willing to wait (this was
        especially severe when a specific lookup in a database or over
        DNS took 30 or more seconds).  The obvious solution was to make
        the server multi-threaded.  Achieving this was simple with UDP.
        Separate processes were spawned to serve each request and these
        processes could respond directly to the client NAS with a simple
        UDP packet to the original transport of the client.

   It's not all a panacea.  As noted, using UDP requires one thing which
   is built into TCP: with UDP we must artificially manage
   retransmission timers to the same server, although they don't require
   the same attention to timing provided by TCP.  This one penalty is a
   small price to pay for the advantages of UDP in this protocol.

   Without TCP we would still probably be using tin cans connected by
   string.  But for this particular protocol, UDP is a better choice.




Rigney, et alia          expires in six months                  [Page 6]
DRAFT                    RADIUS Authentication                  May 1995


3.  Packet Format

   Exactly one RADIUS packet is encapsulated in the UDP Data field [1],
   where the UDP Destination Port field indicates 1645.

   When a reply is generated, the source and destination ports are
   reversed.

A summary of the RADIUS data format is shown below.  The fields are
transmitted from left to right.

 0                   1                   2                   3
 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
|     Code      |  Identifier   |            Length             |
+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
|                                                               |
|                         Authenticator                         |
|                                                               |
|                                                               |
+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
|  Attributes ...
+-+-+-+-+-+-+-+-+-+-+-+-+-


Code

   The Code field is one octet, and identifies the type of RADIUS
   packet.  When a packet is received with an invalid Code field, it is
   silently discarded.

   RADIUS Codes (decimal) are assigned as follows:

        1       Access-Request
        2       Access-Accept
        3       Access-Reject
        4       Accounting-Request
        5       Accounting-Response
       11       Access-Challenge
       12       Status-Server (experimental)
       13       Status-Client (experimental)
      255       Reserved

   Codes 4 and 5 will be covered in the RADIUS Accounting Internet-
   Draft, and are not further mentioned here.  Codes 12 and 13 are
   reserved for possible use, but may be unallocated in a future draft.
   They are not further mentioned here.




Rigney, et alia          expires in six months                  [Page 7]
DRAFT                    RADIUS Authentication                  May 1995


Identifier

   The Identifier field is one octet, and aids in matching requests and
   replies.

Length

   The Length field is two octets.  It indicates the length of the
   packet including the Code, Identifier, Length, Authenticator and
   Attribute fields.  Octets outside the range of the Length field
   should be treated as padding and should be ignored on reception.

Authenticator

   The Authenticator field is sixteen (16) octets.  The most significant
   octet is transmitted first.  This value is used to authenticate the
   reply from the RADIUS server, and is used in the password hiding
   algorithm.

   Request Authenticator

      In Access-Request Packets, the Authenticator value is a 16 octet
      random number.  The value SHOULD be unique and unpredictable.

      In Access-Request packets, the Authenticator value SHOULD be
      unique over the lifetime of a secret (the password shared between
      the client and the RADIUS server), since repetition of a request
      value in conjunction with the same secret would permit an attacker
      to reply with a previously intercepted response.  Since it is
      expected that the same secret MAY be used to authenticate with
      servers in disparate geographic regions, the request authenticator
      field SHOULD exhibit global and temporal uniqueness.

      Each Authenticator value in Access-Request packets SHOULD also be
      unpredictable, lest an attacker trick a server into responding to
      a predicted future request, and then use the response to
      masquerade as that server to another authenticator.

      Although protocols such as RADIUS are incapable of protecting
      against theft of an authenticated session via realtime active
      wiretapping attacks, generation of unique unpredictable requests
      can protect against a wide range of active attacks against
      authentication.

      The NAS and RADIUS server share a secret.  That shared secret
      followed by the Authenticator is put through a one-way MD5 hash to
      create a 16 octet digest value which is xored with the 
      User-Password in the Access-Request packet.



Rigney, et alia          expires in six months                  [Page 8]
DRAFT                    RADIUS Authentication                  May 1995


   Response Authenticator

      The Authenticator field in Access-Accept, Access-Reject, and
      Access-Challenge packets contains a one-way MD5 hash calculated
      over a stream of octets consisting of the RADIUS packet, beginning
      with the Code field, including the Identifier, the Length, the
      Authenticator field from the Access-Request packet, and the
      response Attributes, followed by (concatenated with) a "shared
      secret".

Administrative Note

   The secret (password shared between the client and the RADIUS server)
   SHOULD be at least as large and unguessable as a well-chosen
   password.  It is preferred that the secret be at least 16 octets.
   This is to ensure a sufficiently large range for the secret to
   provide protection against exhaustive search attacks.

Attributes

   Many Attributes may have multiple instances, in such a case the order
   of Attributes of the same Type SHOULD be preserved.  The order of
   Attributes of different Types is not required to be preserved.




























Rigney, et alia          expires in six months                  [Page 9]
DRAFT                    RADIUS Authentication                  May 1995


4.  Packet Types

   The RADIUS Packet type is determined by the Code field in the first
   octet of the Packet.



4.1.  Access-Request

   Description

      Access-Request packets are sent to a RADIUS server, and convey
      information used to determine whether a user is allowed access to
      a specific NAS, and any special services requested for that user.
      An implementation wishing to Authenticate a user MUST transmit a
      RADIUS packet with the Code field set to 1 (Access-Request).

      Upon receipt of an Access-Request, an appropriate reply MUST be
      transmitted.

      An Access-Request MUST contain a User-Name atttribute.  It MUST
      contain either a NAS-IP-Address attribute or NAS-Identifier
      attribute (or both, although that is not recommended).  It MUST
      contain either a User-Password attribute or CHAP-Password
      attribute.  It SHOULD contain a NAS-Port attribute unless the type
      of access being requested does not involve a port or the NAS does
      not distinguish among its ports.

      It MAY contain additional attributes as a hint to the server.

      When a password is present, it is hidden using a method based on
      the RSA Message Digest Algorithm MD5 [3].

   A summary of the Access-Request packet format is shown below.  The
   fields are transmitted from left to right.

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |     Code      |  Identifier   |            Length             |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                                                               |
   |                         Authenticator                         |
   |                                                               |
   |                                                               |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |  Attributes ...
   +-+-+-+-+-+-+-+-+-+-+-+-+-



Rigney, et alia          expires in six months                 [Page 10]
DRAFT                    RADIUS Authentication                  May 1995


   Code

      1 for Access-Request.

   Identifier

      The Identifier field MUST be changed whenever the content of the
      Attributes field changes, and whenever a valid reply has been
      received for a previous request.  For retransmissions, the
      Identifier MAY remain unchanged.

   Authenticator

      The Authenticator value MUST be changed each time a new Identifier
      is used.

   Attributes

      The Attribute field is variable in length, and contains the list
      of Attributes that are required for the type of service, as well
      as any desired optional Attributes.



4.2.  Access-Accept

   Description

      Access-Accept packets are sent by the RADIUS server, and provide
      specific configuration information necessary to begin delivery of
      services to the user.  If all Attribute values received in an
      Access-Request are acceptable then the RADIUS implementation MUST
      transmit a packet with the Code field set to 2 (Access-Accept).

      On reception of an Access-Accept, the Identifier field is matched
      with a pending Access-Request.  Additionally, the Authenticator
      field MUST contain the correct response for the pending 
      Access-Request.  Invalid packets are silently discarded.

   A summary of the Access-Accept packet format is shown below.  The
   fields are transmitted from left to right.










Rigney, et alia          expires in six months                 [Page 11]
DRAFT                    RADIUS Authentication                  May 1995



    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |     Code      |  Identifier   |            Length             |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                                                               |
   |                         Authenticator                         |
   |                                                               |
   |                                                               |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |  Attributes ...
   +-+-+-+-+-+-+-+-+-+-+-+-+-


   Code

      2 for Access-Accept.

   Identifier

      The Identifier field is a copy of the Identifier field of the
      Access-Request which caused this Access-Accept.

   Authenticator

      The Authenticator value is calculated from the Access-Request
      value, as described earlier.

   Attributes

      The Attribute field is variable in length, and contains a list of
      zero or more Attributes.



4.3.  Access-Reject

   Description

      If any value of the received Attributes is not acceptable, then
      the RADIUS server MUST transmit a packet with the Code field set
      to 3 (Access-Reject).  It MAY include one or more Reply-Message
      Attributes with a text message which the NAS MAY display to the
      user.

   A summary of the Access-Reject packet format is shown below.  The
   fields are transmitted from left to right.



Rigney, et alia          expires in six months                 [Page 12]
DRAFT                    RADIUS Authentication                  May 1995



    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |     Code      |  Identifier   |            Length             |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                                                               |
   |                         Authenticator                         |
   |                                                               |
   |                                                               |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |  Attributes ...
   +-+-+-+-+-+-+-+-+-+-+-+-+-


   Code

      3 for Access-Reject.

   Identifier

      The Identifier field is a copy of the Identifier field of the
      Access-Request which caused this Access-Reject.

   Authenticator

      The Authenticator value is calculated from the Access-Request
      value, as described earlier.

   Attributes

      The Attribute field is variable in length, and contains a list of
      zero or more Attributes.



4.4.  Access-Challenge

   Description

      If the RADIUS server desires to send the user a challenge
      requiring a response, then the RADIUS server MUST respond to the
      Access-Request by transmitting a packet with the Code field set to
      11 (Access-Challenge).

      The Attributes field MAY have one or more Reply-Message
      Attributes, and MAY have a single State Attribute, or none.  No
      other Attributes are permitted in an Access-Challenge.



Rigney, et alia          expires in six months                 [Page 13]
DRAFT                    RADIUS Authentication                  May 1995


      On receipt of an Access-Challenge, the Identifier field is matched
      with a pending Access-Request.  Additionally, the Authenticator
      field MUST contain the correct response for the pending 
      Access-Request.  Invalid packets are silently discarded.

      If the NAS supports challenge/response, receipt of a valid
      Access-Challenge indicates that a new Access-Request SHOULD be
      submitted.  The NAS MAY display the text message, if any, to the
      user, and then prompt the user for a response.  It then re-submits
      its original Access-Request with a new request ID, with the 
      User-Password Attribute replaced by the user's response (encrypted),
      and including the State Attribute from the "Access-Challenge", if
      any.  Only 0 or 1 instances of the State Attribute can be present
      in a request.

      A NAS which supports PAP MAY forward the Reply-Message to the
      dialin client and accept a PAP response which it can use as though
      the user had entered the response.

   A summary of the Access-Challenge packet format is shown below.  The
   fields are transmitted from left to right.

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |     Code      |  Identifier   |            Length             |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |                                                               |
   |                         Authenticator                         |
   |                                                               |
   |                                                               |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |  Attributes ...
   +-+-+-+-+-+-+-+-+-+-+-+-+-


   Code

      11 for Access-Challenge.

   Identifier

      The Identifier field is a copy of the Identifier field of the
      Access-Request which caused this Access-Challenge.

   Authenticator

      The Authenticator value is calculated from the Access-Request



Rigney, et alia          expires in six months                 [Page 14]
DRAFT                    RADIUS Authentication                  May 1995


      value, as described earlier.

   Attributes

      The Attributes field is variable in length, and contains a list of
      zero or more Attributes.













































Rigney, et alia          expires in six months                 [Page 15]
DRAFT                    RADIUS Authentication                  May 1995


5.  Attributes

   RADIUS Attributes carry the specific authentication, authorization,
   information and configuration details for the request and reply.

   Some Attributes MAY be listed more than once.  The effect of this is
   Attribute specific, and is specified by each such Attribute
   description.

   The end of the list of Attributes is indicated by the length of the
   RADIUS packet.

   A summary of the Attribute format is shown below.  The fields are
   transmitted from left to right.

    0                   1                   2
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-
   |     Type      |    Length     |  Value ...
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-


   Type

      The Type field is one octet.  Up-to-date values of the RADIUS Type
      field are specified in the most recent "Assigned Numbers" RFC [2].
      Values 192-223 are reserved for experimental use, values 224-240
      are reserved for implementation-specific use, and values 241-255
      are reserved and should not be used.  This specification concerns
      the following values:

          1      User-Name
          2      User-Password
          3      CHAP-Password
          4      NAS-IP-Address
          5      NAS-Port
          6      Service-Type
          7      Framed-Protocol
          8      Framed-IP-Address
          9      Framed-IP-Netmask
         10      Framed-Routing
         11      Filter-Id
         12      Framed-MTU
         13      Framed-Compression
         14      Login-IP-Host
         15      Login-Service
         16      Login-Port
         17      (unassigned)



Rigney, et alia          expires in six months                 [Page 16]
DRAFT                    RADIUS Authentication                  May 1995


         18      Reply-Message
         19      Login-Callback-Number
         20      Framed-Callback-Id
         21      (unassigned)
         22      Framed-Route
         23      Framed-IPX-Network
         24      State
         25      Class
         26      Vendor-Specific
         27      Session-Timeout
         28      Idle-Timeout
         29      Termination-Action
         30      Client-Port-DNIS
         31      Caller-ID
         32      NAS-Identifier
         33      Proxy-State
         34      Login-LAT-Service
         35      Login-LAT-Node
         36      Login-LAT-Group
         37      Framed-AppleTalk-Link
         38      Framed-AppleTalk-Network
         39      Framed-AppleTalk-Zone
         40-49   Reserved for Accounting

   Length

      The Length field is one octet, and indicates the length of this
      Attribute including the Type, Length and Value fields.  If an
      Attribute is received in a Access-Request but with an invalid
      Length, an Access-Reject SHOULD be transmitted.

   Value

      The Value field is zero or more octets and contains information
      specific to the Attribute.  The format and length of the Value
      field is determined by the Type and Length fields.

      The format of the value field is one of four data types.

      string    0-253 octets

      address   32 bit value, most significant octet first.

      integer   32 bit value, most significant octet first.

      time      32 bit value, most significant octet first -- seconds
                since 00:00:00 GMT, January 1, 1970.




Rigney, et alia          expires in six months                 [Page 17]
DRAFT                    RADIUS Authentication                  May 1995


5.1.  User-Name

   Description

      This Attribute indicates the name of the user to be authenticated.
      It is only used in Access-Request packets.

   A summary of the User-Name Attribute format is shown below.  The
   fields are transmitted from left to right.

    0                   1                   2
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-
   |     Type      |    Length     |  String ...
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-


   Type

      1 for User-Name.

   Length

      >= 3

   String

      The String field is one or more octets.  The NAS may limit the
      maximum length of the User-Name but the ability to handle at least
      63 octets is recommended.

      The format of the username MAY be one of several forms:

      monolithic Consisting only of alphanumeric characters.  This
                simple form might be used to locally manage a NAS.

      simple    Consisting only of printable ASCII characters.

      name@fqdn SMTP address.  The Fully Qualified Domain Name (with or
                without trailing dot) indicates the realm in which the
                name part applies.

      distinguished name
                A name in ASN.1 form used in Public Key authentication
                systems.






Rigney, et alia          expires in six months                 [Page 18]
DRAFT                    RADIUS Authentication                  May 1995


5.2.  User-Password

   Description

      This Attribute indicates the password of the user to be
      authenticated, or the user's input following an Access-Request.
      It is only used in Access-Request packets.

      On transmission, the password is hidden.  A one-way MD5 hash is
      calculated over a stream of octets consisting of the "shared
      secret", followed by (concatenated with) the Request
      Authenticator.  This value is xor'd with each successive 16 octet
      segment of the password.

      Note that this encryption scheme is very strong for passwords 16
      octets or shorter and quite weak for passwords longer than 16
      octets.  Alternative methods to allow longer passwords to be
      safely used are the topic of further research.

      On receipt, the same mask is created.  Repeating the xor function
      yields the original password.


   A summary of the User-Password Attribute format is shown below.  The
   fields are transmitted from left to right.

    0                   1                   2
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-
   |     Type      |    Length     |  String ...
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-


   Type

      2 for User-Password.

   Length

      >= 18

   String

      The String field is one or more octets.







Rigney, et alia          expires in six months                 [Page 19]
DRAFT                    RADIUS Authentication                  May 1995


5.3.  CHAP-Password

   Description

      This Attribute indicates the response value provided by a PPP
      Challenge-Handshake Authentication Protocol (CHAP) user in
      response to the challenge.  It is only used in Access-Request
      packets.

      The CHAP challenge value is found in the RADIUS Authenticator
      field.

   A summary of the CHAP-Password Attribute format is shown below.  The
   fields are transmitted from left to right.

    0                   1                   2
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-
   |     Type      |    Length     |  CHAP Ident   |  String ...
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-


   Type

      3 for CHAP-Password.

   Length

      >= 19

   CHAP Ident

      This field is one octet, and contains the CHAP Identifier from the
      CHAP Response packet.

   String

      The String field is 16 octets when MD5 is used for CHAP.



5.4.  NAS-IP-Address

   Description

      This Attribute indicates the identifying IP Address of the NAS
      which is authenticating the user.  It is only used in 
      Access-Request packets.  Either NAS-IP-Address or NAS-Identifier



Rigney, et alia          expires in six months                 [Page 20]
DRAFT                    RADIUS Authentication                  May 1995


      MUST be present in an Access-Request packet.

   A summary of the NAS-IP-Address Attribute format is shown below.  The
   fields are transmitted from left to right.

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |     Type      |    Length     |            Address
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
            Address (cont)         |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


   Type

      4 for NAS-IP-Address.

   Length

      6

   Address

      The Address field is four octets.



5.5.  NAS-Port

   Description

      This Attribute indicates the port number of the NAS which is
      authenticating the user.  It is only used in Access-Request
      packets.

   A summary of the NAS-Port Attribute format is shown below.  The
   fields are transmitted from left to right.

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |     Type      |    Length     |             Value
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
              Value (cont)         |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+





Rigney, et alia          expires in six months                 [Page 21]
DRAFT                    RADIUS Authentication                  May 1995


   Type

      5 for NAS-Port.

   Length

      6

   Value

      The Value field is four octets.  Despite the rather large size of
      the field, values range from 0 to 65535.



5.6.  Service-Type

   Description

      This Attribute indicates the type of link the user has requested,
      or a change in the type of link to be configured.  It is used in
      both Access-Request and Access-Accept packets.

   A summary of the Service-Type Attribute format is shown below.  The
   fields are transmitted from left to right.

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |     Type      |    Length     |             Value
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
              Value (cont)         |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


   Type

      6 for Service-Type.

   Length

      6

   Value

      The Value field is four octets.





Rigney, et alia          expires in six months                 [Page 22]
DRAFT                    RADIUS Authentication                  May 1995



       1      Login
       2      Framed
       3      Callback Login
       4      Callback Framed
       5      Outbound User
       6      Administrative User
       7      Exec User
       8      Authenticate Only




5.7.  Framed-Protocol

   Description

      This Attribute indicates the framing to be used for framed access.
      It is used in both Access-Request and Access-Accept packets.

   A summary of the Framed-Protocol Attribute format is shown below.
   The fields are transmitted from left to right.

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |     Type      |    Length     |             Value
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
              Value (cont)         |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


   Type

      7 for Framed-Protocol.

   Length

      6

   Value

      The Value field is four octets.

       1      PPP
       2      SLIP





Rigney, et alia          expires in six months                 [Page 23]
DRAFT                    RADIUS Authentication                  May 1995


5.8.  Framed-IP-Address

   Description

      This Attribute indicates the address to be configured for the
      user.  It is only used in Access-Accept packets.

   A summary of the Framed-IP-Address Attribute format is shown below.
   The fields are transmitted from left to right.

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |     Type      |    Length     |            Address
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
            Address (cont)         |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


   Type

      8 for Framed-IP-Address.

   Length

      6

   Address

      The Address field is four octets.  The value 0xFFFFFFFF indicates
      that the NAS should allow the user to select an address (e.g.
      Negotiated).  The value 0xFFFFFFFE indicates that the NAS should
      select an address for the user (e.g. Assigned from a pool of
      addresses kept by the NAS).



5.9.  Framed-IP-Netmask

   Description

      This Attribute indicates the IP netmask to be configured for the
      user when the user is a router to a network.  It is unnecessary
      when routing is used.  It is only used in Access-Accept packets.

   A summary of the Framed-IP-Netmask Attribute format is shown below.
   The fields are transmitted from left to right.




Rigney, et alia          expires in six months                 [Page 24]
DRAFT                    RADIUS Authentication                  May 1995



    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |     Type      |    Length     |            Netmask
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
            Netmask (cont)         |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


   Type

      9 for Framed-IP-Netmask.

   Length

      6

   Netmask

      The Netmask field is four octets.



5.10.  Framed-Routing

   Description

      This Attribute indicates the routing method for the user, when the
      user is a router to a network.  It is only used in Access-Accept
      packets.

   A summary of the Framed-Routing Attribute format is shown below.  The
   fields are transmitted from left to right.

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |     Type      |    Length     |             Value
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
              Value (cont)         |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


   Type

      10 for Framed-Routing.




Rigney, et alia          expires in six months                 [Page 25]
DRAFT                    RADIUS Authentication                  May 1995


   Length

      6

   Value

      The Value field is four octets.

       0      None
       1      Send routing packets
       2      Listen for routing packets
       3      Send and Listen




5.11.  Filter-Id

   Description

      This Attribute indicates the name of the filter list for this
      user.

      Using a name for a filter list allows independence from multiple
      NAS implementations.  However, the name used might be dependent on
      the NAS making the request, rather than the user.

   A summary of the Filter-Id Attribute format is shown below.  The
   fields are transmitted from left to right.

    0                   1                   2
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-
   |     Type      |    Length     |  String ...
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-


   Type

      11 for Filter-Id.

   Length

      >= 3

   String

      The String field is one or more octets.



Rigney, et alia          expires in six months                 [Page 26]
DRAFT                    RADIUS Authentication                  May 1995


5.12.  Framed-MTU

   Description

      This Attribute indicates the Maximum Transmission Unit to be
      configured for the user, when it is not negotiated by some other
      means (such as PPP).  It is only used in Access-Accept packets.

   A summary of the Framed-MTU Attribute format is shown below.  The
   fields are transmitted from left to right.

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |     Type      |    Length     |             Value
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
              Value (cont)         |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


   Type

      12 for Framed-MTU.

   Length

      6

   Value

      The Value field is four octets.  Despite the rather large size of
      the field, values range from 64 to 65535.



5.13.  Framed-Compression

   Description

      This Attribute indicates a compression protocol to be used for the
      link.

      More than one compression protocol Attribute MAY be sent.  It is
      the responsibility of the NAS to apply the proper compression
      protocol to appropriate link traffic.

   A summary of the Framed-Compression Attribute format is shown below.
   The fields are transmitted from left to right.



Rigney, et alia          expires in six months                 [Page 27]
DRAFT                    RADIUS Authentication                  May 1995



    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |     Type      |    Length     |             Value
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
              Value (cont)         |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


   Type

      13 for Framed-Compression.

   Length

      6

   Value

      The Value field is four octets.

       1      VJ TCP/IP header compression
       2      IPX header compression




5.14.  Login-IP-Host

   Description

      This Attribute indicates the system with which the user is to be
      automatically connected, when the Login-Service Attribute is
      listed.  It is only used in Access-Accept packets.

   A summary of the Login-IP-Host Attribute format is shown below.  The
   fields are transmitted from left to right.

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |     Type      |    Length     |            Address
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
            Address (cont)         |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+





Rigney, et alia          expires in six months                 [Page 28]
DRAFT                    RADIUS Authentication                  May 1995


   Type

      14 for Login-IP-Host.

   Length

      6

   Address

      The Address field is four octets.  The value 0xFFFFFFFF indicates
      that the NAS SHOULD allow the user to select an address.  The
      value 0 indicates that the NAS SHOULD select a host to connect the
      user to.



5.15.  Login-Service

   Description

      This Attribute indicates the service with which the user is to be
      automatically connected.  It is only used in Access-Accept
      packets.

   A summary of the Login-Service Attribute format is shown below.  The
   fields are transmitted from left to right.

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |     Type      |    Length     |             Value
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
              Value (cont)         |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


   Type

      15 for Login-Service.

   Length

      6

   Value

      The Value field is four octets.



Rigney, et alia          expires in six months                 [Page 29]
DRAFT                    RADIUS Authentication                  May 1995



       0      Telnet
       1      Rlogin
       2      TCP
       3      Portmaster (proprietary)
       4      LAT




5.16.  Login-Port

   Description

      This Attribute indicates the TCP (or LAT) port with which the user
      is to be automatically connected, when the Login-Service Attribute
      is also present.  It is only used in Access-Accept packets.

   A summary of the Login-Port Attribute format is shown below.  The
   fields are transmitted from left to right.

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |     Type      |    Length     |             Value
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
              Value (cont)         |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


   Type

      16 for Login-Port.

   Length

      6

   Value

      The Value field is four octets.  Despite the rather large size of
      the field, values range from 0 to 65535.



5.17.  (unassigned)

   Description



Rigney, et alia          expires in six months                 [Page 30]
DRAFT                    RADIUS Authentication                  May 1995


      ATTRIBUTE TYPE 17 HAS NOT BEEN ASSIGNED.



5.18.  Reply-Message

   Description

      This Attribute indicates text which MAY be displayed to the user.

      When used in an Access-Accept, it is the success message.

      When used in an Access-Reject, it is the failure message.  It MAY
      indicate a dialog message to prompt the user before another
      Access-Request attempt.

      When used in an Access-Challenge, it MAY indicate a dialog message
      to prompt the user for a response.

      Multiple Reply-Message's MAY be included and if any are displayed,
      they MUST be displayed in the same order as they appear in the
      packet.

   A summary of the Reply-Message Attribute format is shown below.  The
   fields are transmitted from left to right.

    0                   1                   2
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-
   |     Type      |    Length     |  String ...
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-


   Type

      18 for Reply-Message.

   Length

      >= 3

   String

      The String field is one or more octets, and its contents are
      implementation dependent.  It is intended to be human readable,
      and MUST NOT affect operation of the protocol.  It is recommended
      that the message contain displayable ASCII characters 32 through
      126 decimal.  Mechanisms for extension to other character sets are



Rigney, et alia          expires in six months                 [Page 31]
DRAFT                    RADIUS Authentication                  May 1995


      the topic of future research.



5.19.  Login-Callback-Number

   Description

      This Attribute indicates a dialing string to be used for callback.
      It is used in both Access-Request and Access-Accept packets.

   A summary of the Login-Callback-Number Attribute format is shown
   below.  The fields are transmitted from left to right.

    0                   1                   2
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-
   |     Type      |    Length     |  String ...
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-


   Type

      19 for Login-Callback-Number.

   Length

      >= 3

   String

      The String field is one or more octets.  The actual format of the
      information is site or application specific, and a robust
      implementation SHOULD support the field as undistinguished octets.

      It is intended that only an authorized user will have correct site
      specific information to make use of the Callback.  The
      codification of the range of allowed usage of this field is
      outside the scope of this specification.



5.20.  Framed-Callback-Id

   Description

      This Attribute indicates the name of a place to be called.  It can
      be used in Access-Accept packets.



Rigney, et alia          expires in six months                 [Page 32]
DRAFT                    RADIUS Authentication                  May 1995


   A summary of the Framed-Callback-Id Attribute format is shown below.
   The fields are transmitted from left to right.

    0                   1                   2
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-
   |     Type      |    Length     |  String ...
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-


   Type

      20 for Framed-Callback-Id.

   Length

      >= 3

   String

      The String field is one or more octets.  The actual format of the
      information is site or application specific, and a robust
      implementation SHOULD support the field as undistinguished octets.

      It is intended that only an authorized user will have correct site
      specific information to make use of the Callback.  The
      codification of the range of allowed usage of this field is
      outside the scope of this specification.



5.21.  (unassigned)

   Description

      ATTRIBUTE TYPE 21 HAS NOT BEEN ASSIGNED.



5.22.  Framed-Route

   Description

      This Attribute provides routing information to be configured for
      the user.  It is used in the Access-Accept packet and can appear
      multiple times.

   A summary of the Framed-Route Attribute format is shown below.  The



Rigney, et alia          expires in six months                 [Page 33]
DRAFT                    RADIUS Authentication                  May 1995


   fields are transmitted from left to right.

    0                   1                   2
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-
   |     Type      |    Length     |  String...
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-


   Type

      22 for Framed-Route.

   Length

      >= 3

   String

      The String field is one or more octets, and its contents are
      implementation dependent.  It is intended to be human readable and
      MUST NOT affect operation of the protocol.  It is recommended that
      the message contain displayable ASCII characters 32 through 126
      decimal.

      It MAY contain a destination address in dotted quad form, a space,
      a gateway address in dotted quad form, a space, and a decimal
      metric, for example, "199.9.200.0 192.9.200.1 1".

      Whenever the gateway address is specified as "0.0.0.0" the IP
      address of the user SHOULD be used as the gateway address.



5.23.  Framed-IPX-Network

   Description

      This Attribute indicates the IPX Network number to be configured
      for the user.  It is used in Access-Accept packets.

   A summary of the Framed-IPX-Network Attribute format is shown below.
   The fields are transmitted from left to right.








Rigney, et alia          expires in six months                 [Page 34]
DRAFT                    RADIUS Authentication                  May 1995



    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |     Type      |    Length     |             Value
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
              Value (cont)         |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


   Type

      23 for Framed-IPX-Network.

   Length

      6

   Value

      The Value field is four octets.  The value 0xFFFFFFFE indicates
      that the NAS should select an IPX network for the user (e.g.
      Assigned from a pool of ipx networks kept by the NAS).



5.24.  State

   Description

      This Attribute is available to be sent by the server to the client
      in an Access-Challenge and should be sent unmodified from the
      client to the server in the new Access-Request reply to that
      Challenge, if any.  No interpretation by the client should be
      made.  A packet may have only one State Attribute.  Usage of the
      State Attribute is implementation dependent.

   A summary of the State Attribute format is shown below.  The fields
   are transmitted from left to right.

    0                   1                   2
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-
   |     Type      |    Length     |  String ...
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-






Rigney, et alia          expires in six months                 [Page 35]
DRAFT                    RADIUS Authentication                  May 1995


   Type

      24 for State.

   Length

      >= 3

   String

      The String field is one or more octets.  The actual format of the
      information is site or application specific, and a robust
      implementation SHOULD support the field as undistinguished octets.

      The codification of the range of allowed usage of this field is
      outside the scope of this specification.



5.25.  Class

   Description

      This Attribute is available to be sent by the server to the client
      in an Access-Accept and should be sent unmodified by the client to
      the accounting server as part of the Accounting-Request packet if
      accounting is supported.  No interpretation by the client should
      be made.

   A summary of the Class Attribute format is shown below.  The fields
   are transmitted from left to right.

    0                   1                   2
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-
   |     Type      |    Length     |  String ...
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-


   Type

      25 for Class.

   Length

      >= 3





Rigney, et alia          expires in six months                 [Page 36]
DRAFT                    RADIUS Authentication                  May 1995


   String

      The String field is one or more octets.  The actual format of the
      information is site or application specific, and a robust
      implementation SHOULD support the field as undistinguished octets.

      The codification of the range of allowed usage of this field is
      outside the scope of this specification.



5.26.  Vendor-Specific

   Description

      This Attribute is available to allow vendors to support their own
      extended Attributes not suitable for general usage.  It MUST not
      affect the operation of the RADIUS protocol.

   A summary of the Vendor-Specific Attribute format is shown below.
   The fields are transmitted from left to right.

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |     Type      |  Length       |            Vendor-Id
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |    Vendor-Id (cont)           |  String...
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-


   Type

      26 for Vendor-Specific.

   Length

      >= 7

   Vendor-Id
      The high-order octet is 0 and the low-order 3 octets is the OID of
      the Vendor, as defined in the Assigned Numbers RFC [2].

   String

      The String field is one or more octets.  The actual format of the
      information is site or application specific, and a robust
      implementation SHOULD support the field as undistinguished octets.



Rigney, et alia          expires in six months                 [Page 37]
DRAFT                    RADIUS Authentication                  May 1995


      The codification of the range of allowed usage of this field is
      outside the scope of this specification.



5.27.  Session-Timeout

   Description

      This Attribute sets the maximum number of seconds of service to be
      provided to the user before termination of the session.  This
      Attribute is available to be sent by the server to the client in
      an Access-Accept.

   A summary of the Session-Timeout Attribute format is shown below.
   The fields are transmitted from left to right.

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |     Type      |    Length     |             Value
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
              Value (cont)         |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


   Type

      27 for Session-Timeout.

   Length

      6

   Value

      The field is 4 octets, containing a 32-bit unsigned integer with
      the maximum number of seconds this user should be allowed to
      remain connected by the NAS.



5.28.  Idle-Timeout

   Description

      This Attribute sets the maximum number of consecutive seconds of
      idle connection allowed to the user before termination of the



Rigney, et alia          expires in six months                 [Page 38]
DRAFT                    RADIUS Authentication                  May 1995


      session.  This Attribute is available to be sent by the server to
      the client in an Access-Accept.

   A summary of the Idle-Timeout Attribute format is shown below.  The
   fields are transmitted from left to right.

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |     Type      |    Length     |             Value
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
              Value (cont)         |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


   Type

      28 for Idle-Timeout.

   Length

      6

   Value

      The field is 4 octets, containing a 32-bit unsigned integer with
      the maximum number of consecutive seconds of idle time this user
      should be permitted before being disconnected by the NAS.



5.29.  Termination-Action

   Description

      This Attribute indicates what action the NAS should take when the
      specified service is completed.  It is only used in Access-Accept
      packets.

   A summary of the Termination-Action Attribute format is shown below.
   The fields are transmitted from left to right.










Rigney, et alia          expires in six months                 [Page 39]
DRAFT                    RADIUS Authentication                  May 1995



    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |     Type      |    Length     |             Value
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
              Value (cont)         |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


   Type

      29 for Termination-Action.

   Length

      6

   Value

      The Value field is four octets.

       0      Default
       1      RADIUS-Request


      If the Value is set to RADIUS-Request, upon termination of the
      specified service the NAS MAY send a new Access-Request to the
      RADIUS server, including the State attribute if any.



5.30.  Client-Port-DNIS

   Description

      This Attribute allows the NAS to send in the Access-Request packet
      the phone number that the call came in on, using DNIS or similar
      technology.  It is only used in Access-Request packets.

      [NOTE! A better name for this attribute is sought.]

   A summary of the Client-Port-DNIS Attribute format is shown below.
   The fields are transmitted from left to right.







Rigney, et alia          expires in six months                 [Page 40]
DRAFT                    RADIUS Authentication                  May 1995



    0                   1                   2
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-
   |     Type      |    Length     |  String ...
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-


   Type

      30 for Client-Port-DNIS.

   Length

      >= 3

   String

      The String field is one or more octets, containing the phone
      number that the user's call came in on.

      The actual format of the information is site or application
      specific.  Printable ASCII is recommended, but a robust
      implementation SHOULD support the field as undistinguished octets.
      The codification of the range of allowed usage of this field is
      outside the scope of this specification.



5.31.  Caller-Id

   Description

      This Attribute allows the NAS to send in the Access-Request packet
      the phone number that the call came from, using ANI or similar
      technology.  It is only used in Access-Request packets.

   A summary of the Caller-Id Attribute format is shown below.  The
   fields are transmitted from left to right.

    0                   1                   2
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-
   |     Type      |    Length     |  String ...
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-






Rigney, et alia          expires in six months                 [Page 41]
DRAFT                    RADIUS Authentication                  May 1995


   Type

      31 for Caller-Id.

   Length

      >= 3

   String

      The String field is one or more octets, containing the phone
      number that the user placed the call from.

      The actual format of the information is site or application
      specific.  Printable ASCII is recommended, but a robust
      implementation SHOULD support the field as undistinguished octets.
      The codification of the range of allowed usage of this field is
      outside the scope of this specification.



5.32.  NAS-Identifier

   Description

      This Attribute contains a string identifying the NAS originating
      the Access-Request.  It is only used in Access-Request packets.
      Either NAS-IP-Address or NAS-Identifier must be present in an
      Access-Request packet.

   A summary of the NAS-Identifier Attribute format is shown below.  The
   fields are transmitted from left to right.

    0                   1                   2
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-
   |     Type      |    Length     |  String ...
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-


   Type

      32 for NAS-Identifier.

   Length

      >= 3




Rigney, et alia          expires in six months                 [Page 42]
DRAFT                    RADIUS Authentication                  May 1995


   String

      The String field is one or more octets, and should be unique to
      the NAS within the scope of the RADIUS server.  For example, a
      fully qualified domain name would be suitable as a NAS-Identifier.

      The actual format of the information is site or application
      specific, and a robust implementation SHOULD support the field as
      undistinguished octets.  The codification of the range of allowed
      usage of this field is outside the scope of this specification.



5.33.  Proxy-State

   Description

      This Attribute is available to be sent by a proxy server to
      another server when forwarding an Access-Request and should be
      returned unmodified in the Access-Accept, Access-Reject or
      Access-Challenge.  This attribute should be removed by the proxy
      server before the response is forwarded to the NAS.

      Usage of the Proxy-State Attribute is implementation dependent.  A
      description of its function is outside the scope of this
      specification.

   A summary of the Proxy-State Attribute format is shown below.  The
   fields are transmitted from left to right.

    0                   1                   2
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-
   |     Type      |    Length     |  String ...
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-


   Type

      33 for Proxy-State.

   Length

      >= 3

   String

      The String field is one or more octets.  The actual format of the



Rigney, et alia          expires in six months                 [Page 43]
DRAFT                    RADIUS Authentication                  May 1995


      information is site or application specific, and a robust
      implementation SHOULD support the field as undistinguished octets.

      The codification of the range of allowed usage of this field is
      outside the scope of this specification.



5.34.  Login-LAT-Service

   Description

      This Attribute indicates the system with which the user is to be
      automatically connected by LAT.  It is only used in Access-Accept
      packets.  It is used only when LAT is specified as the 
      Login-Service.

      Administrators use the service attribute when dealing with
      clustered systems, such as a VAX or Alpha cluster. In such an
      environment several different time sharing hosts share the same
      resources (disks, printers, etc.), and administrators often
      configure each to offer access (service) to each of the shared
      resources. In this case, each host in the cluster advertises its
      services through LAT broadcasts.

      Sophisticated users often know which service providers (machines)
      are faster and tend to use a node name when initiating a LAT
      connection.  Alternately, some administrators want particular
      users to use certain machines as a primitive form of load
      balancing (although LAT knows how to do load balancing itself).

   A summary of the Login-LAT-Service Attribute format is shown below.
   The fields are transmitted from left to right.

    0                   1                   2
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-
   |     Type      |    Length     |  String ...
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-


   Type

      34 for Login-LAT-Service.

   Length

      >= 3



Rigney, et alia          expires in six months                 [Page 44]
DRAFT                    RADIUS Authentication                  May 1995


   String

      The String field is one or more octets, and contains the identity
      of the LAT service to use.  A robust implementation SHOULD support
      the field as undistinguished octets.

      The codification of the range of allowed usage of this field is
      outside the scope of this specification.



5.35.  Login-LAT-Node

   Description

      This Attribute indicates the Node with which the user is to be
      automatically connected by LAT.  It is only used in Access-Accept
      packets.  It is used only when LAT is specified as the 
      Login-Service.

   A summary of the Login-LAT-Node Attribute format is shown below.  The
   fields are transmitted from left to right.

    0                   1                   2
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-
   |     Type      |    Length     |  String ...
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-


   Type

      35 for Login-LAT-Node.

   Length

      >= 3

   String

      The String field is one or more octets, and contains the identity
      of the LAT Node to connect the user to.  A robust implementation
      SHOULD support the field as undistinguished octets.

      The codification of the range of allowed usage of this field is
      outside the scope of this specification.





Rigney, et alia          expires in six months                 [Page 45]
DRAFT                    RADIUS Authentication                  May 1995


5.36.  Login-LAT-Group

   Description

      This Attribute contains a string identifying the LAT group codes
      which this user is authorized to use.  It is only used in 
      Access-Request packets.  It is used only when LAT is specified
      as the Login-Service.

      LAT supports 256 different group codes, which LAT uses as a form
      of access rights.  LAT encodes the group codes as a 256 bit
      bitmap.

      Administrators can assign one or more of the group code bits at
      the LAT service provider; it will only accept LAT connections that
      have these group codes set in the bit map. Then the administrators
      assign a bit map of authorized group codes to each user; LAT gets
      these from the operating system, and uses these in its requests to
      the service providers.

   A summary of the Login-LAT-Group Attribute format is shown below.
   The fields are transmitted from left to right.

    0                   1                   2
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-
   |     Type      |    Length     |  String ...
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-


   Type

      36 for Login-LAT-Group.

   Length

      34

   String

      The String field is a 32 octet bit map, most significant octet
      first.  A robust implementation SHOULD support the field as
      undistinguished octets.

      The codification of the range of allowed usage of this field is
      outside the scope of this specification.





Rigney, et alia          expires in six months                 [Page 46]
DRAFT                    RADIUS Authentication                  May 1995


5.37.  Framed-AppleTalk-Link

   Description

      This Attribute indicates the AppleTalk network number which should
      be used for the serial link to the user, which is another
      AppleTalk router.  It is only used in Access-Accept packets.  It
      is never used when the user is not another router.

   A summary of the Framed-AppleTalk-Link Attribute format is shown
   below.  The fields are transmitted from left to right.

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |     Type      |    Length     |             Value
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
              Value (cont)         |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


   Type

      37 for Framed-Appletalk-Link.

   Length

      6

   Value

      The Value field is four octets.  Despite the rather large size of
      the field, values range from 0 to 65535.  The special value of 0
      indicates that this is an unnumbered serial link.  A value of 
      1-65535 means that the serial line between the NAS and the user
      should be assigned that value as a network number.



5.38.  Framed-AppleTalk-Network

   Description

      This Attribute indicates the AppleTalk Network number which the
      NAS should probe to allocate an address for the user.  It is only
      used in Access-Accept packets.  It is never used when the user is
      another router.  Multiple instances of this Attribute indicate
      that the NAS may probe using any of the network numbers specified.



Rigney, et alia          expires in six months                 [Page 47]
DRAFT                    RADIUS Authentication                  May 1995


   A summary of the Framed-AppleTalk-Network Attribute format is shown
   below.  The fields are transmitted from left to right.

    0                   1                   2                   3
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
   |     Type      |    Length     |             Value
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+
              Value (cont)         |
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+


   Type

      38 for Framed-Appletalk-Network.

   Length

      6

   Value

      The Value field is four octets.  Despite the rather large size of
      the field, values range from 0 to 65535.  The special value 0
      indicates that the NAS should assign a network for the user, using
      its default cable range.  A value between 1 and 65535 (inclusive)
      indicates the AppleTalk Network the NAS should probe to find an
      address for the user.



5.39.  Framed-AppleTalk-Zone

   Description

      This Attribute indicates the AppleTalk Default Zone to be used for
      this user.  It is only used in Access-Accept packets.  Multiple
      instances of this attribute in the same packet are not allowed.

   A summary of the Framed-Appletalk-Zone Attribute format is shown
   below.  The fields are transmitted from left to right.

    0                   1                   2
    0 1 2 3 4 5 6 7 8 9 0 1 2 3 4 5 6 7 8 9 0 1 2 3 4
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-
   |     Type      |    Length     |  String ...
   +-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-+-




Rigney, et alia          expires in six months                 [Page 48]
DRAFT                    RADIUS Authentication                  May 1995


   Type

      39 for Framed-Appletalk-Zone.

   Length

      >= 3

   String

      The name of the Default AppleTalk Zone to be used for this user.
      A robust implementation SHOULD support the field as
      undistinguished octets.

      The codification of the range of allowed usage of this field is
      outside the scope of this specification.



































Rigney, et alia          expires in six months                 [Page 49]
DRAFT                    RADIUS Authentication                  May 1995


5.40.  Table of Attributes

   The following table provides a guide to which attributes may be found
   in which kinds of packets, and in what quantity.


     Request   Accept   Reject   Challenge          Attribute
     1         0        0        0           User-Name
     0-1       0        0        0           User-Password [1]
     0-1       0        0        0           CHAP-Password [1]
     0-1       0        0        0           NAS-IP-Address [2]
     1         0        0        0           NAS-Port
     0-1       0-1      0        0           Service-Type
     0-1       0-1      0        0           Framed-Protocol
     0-1       0-1      0        0           Framed-IP-Address
     0-1       0-1      0        0           Framed-IP-Netmask
     0         0-1      0        0           Framed-Routing
     0         0+       0        0           Filter-Id
     0         0-1      0        0           Framed-MTU
     0+        0+       0        0           Framed-Compression
     0+        0+       0        0           Login-IP-Host
     0         0-1      0        0           Login-Service
     0         0-1      0        0           Login-Port
     0         0+       0+       0+          Reply-Message
     0-1       0-1      0        0           Login-Callback-Number
     0         0-1      0        0           Framed-Callback-Id
     0         0+       0        0           Framed-Route
     0         0-1      0        0           Framed-IPX-Network
     0-1       0-1      0        0-1         State
     0         0-1      0        0           Class
     0+        0+       0        0+          Vendor-Specific
     0         0-1      0        0-1         Session-Timeout
     0         0-1      0        0-1         Idle-Timeout
     0         0-1      0        0           Termination-Action
     0-1       0        0        0           Client-Port-DNIS
     0-1       0        0        0           Caller-Id
     0-1       0        0        0           NAS-Identifier [2]
     0+        0+       0+       0+          Proxy-State
     0         0-1      0        0           Login-LAT-Service
     0         0-1      0        0           Login-LAT-Node
     0         0-1      0        0           Login-LAT-Group
     0         0-1      0        0           Framed-AppleTalk-Link
     0         0+       0        0           Framed-AppleTalk-Network
     0         0-1      0        0           Framed-AppleTalk-Zone


   [1] An Access-Request MUST contain either a User-Password or a 
   CHAP-Password, and MUST NOT contain both.



Rigney, et alia          expires in six months                 [Page 50]
DRAFT                    RADIUS Authentication                  May 1995


   [2] An Access-Request MUST contain either a NAS-IP-Address or a NAS-
   Identifier, and it is all right (but not recommended) for it to
   contain both.

   The following table defines the meaning of the above table entries.


 0     This attribute MUST NOT be present in packet.
 0+    Zero or more instances of this attribute MAY be present in packet.
 0-1   Zero or one instance of this attribute MAY be present in packet.
 1     Exactly one instance of this attribute MUST be present in packet.








































Rigney, et alia          expires in six months                 [Page 51]
DRAFT                    RADIUS Authentication                  May 1995


Security Considerations

   Security issues are the primary topic of this document.

   In practice, within or associated with each RADIUS server, there is a
   database which associates "user" names with authentication
   information ("secrets").  It is not anticipated that a particular
   named user would be authenticated by multiple methods.  This would
   make the user vulnerable to attacks which negotiate the least secure
   method from among a set (such as PAP rather than CHAP).  Instead, for
   each named user there should be an indication of exactly one method
   used to authenticate that user name.  If a user needs to make use of
   different authentication methods under different circumstances, then
   distinct user names SHOULD be employed, each of which identifies
   exactly one authentication method.

   Passwords and other secrets should be stored at the respective ends
   such that access to them is as limited as possible.  Ideally, the
   secrets should only be accessible to the process requiring access in
   order to perform the authentication.

   The secrets should be distributed with a mechanism that limits the
   number of entities that handle (and thus gain knowledge of) the
   secret.  Ideally, no unauthorized person should ever gain knowledge
   of the secrets.  It is possible to achieve this with SNMP Security
   Protocols [4], but such a mechanism is outside the scope of this
   specification.

   Other distribution methods are currently undergoing research and
   experimentation.  The SNMP Security document [4] also has an
   excellent overview of threats to network protocols.




















Rigney, et alia          expires in six months                 [Page 52]
DRAFT                    RADIUS Authentication                  May 1995


References

   [1]   Postel, J., "User Datagram Protocol", RFC 768, USC/Information
         Sciences Institute, August 1980.

   [2]   Reynolds, J., and J. Postel, "Assigned Numbers", RFC 1700,
         USC/Information Sciences Institute, October 1994.

   [3]   Rivest, R., and S. Dusse, "The MD5 Message-Digest Algorithm",
         MIT Laboratory for Computer Science and RSA Data Security,
         Inc., RFC 1321, April 1992.

   [4]   Galvin, J., McCloghrie, K., and J. Davin, "SNMP Security
         Protocols", Trusted Information Systems, Inc., Hughes LAN
         Systems, Inc., MIT Laboratory for Computer Science, RFC 1352,
         July 1992.



Acknowledgments

   RADIUS was originally developed by Livingston Enterprises for their
   PortMaster series of Network Access Servers.




























Rigney, et alia          expires in six months                 [Page 53]
DRAFT                    RADIUS Authentication                  May 1995


Chair's Address

   The working group can be contacted via the current chair:

      [TBD]




Author's Address

   Questions about this memo can also be directed to:

      Carl Rigney
      Livingston Enterprises
      6920 Koll Center Parkway, Suite 220
      Pleasanton, California  94566

      EMail: cdr@livingston.com

      Allan C. Rubens
      Merit Network, Inc.
      4251 Plymouth Road
      Ann Arbor, Michigan  48105-2785

      EMail: acr@merit.edu

      William Allen Simpson
      Daydreamer
      Computer Systems Consulting Services
      1384 Fontaine
      Madison Heights, Michigan  48071

      EMail: Bill.Simpson@um.cc.umich.edu

      Steve Willens
      Livingston Enterprises
      6920 Koll Center Parkway, Suite 220
      Pleasanton, California  94566

      EMail: steve@livingston.com










Rigney, et alia          expires in six months                 [Page 54]
